---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CADLinkOperations
source: html/dd1a86e6-ba78-c4c3-8b86-c65748c59811.htm
---
# CADLinkOperations Members

Sets the callback that will be called when the Revit user saves new shared coordinate
 settings to a linked document obtained from an IExternalResourceServer.